[
  {
    "id": 1,
    "estate_title": "Charming Cottage in the Countryside",
    "segment_name": "Single-family homes",
    "description": "Escape to the tranquility of the countryside in this charming cottage, featuring rustic charm and picturesque surroundings.",
    "long_description": "Nestled amidst the rolling hills of the Cotswolds, this enchanting cottage offers an idyllic retreat from the bustle of city life. With its quaint country kitchen, inviting fireplace, and sprawling garden, it embodies the essence of rustic living. Whether enjoying a leisurely stroll through the lush greenery or cozying up by the fire with loved ones, every moment here is infused with serenity and charm. Embrace the simplicity of country living in this timeless sanctuary, where the beauty of nature meets the warmth of home.",
    "price": "$400,000",
    "status": "Sale",
    "area": "2000 sq ft",
    "location": "Cotswolds, England",
    "facilities": ["garden", "fireplace", "country kitchen"],
    "image": "https://i.ibb.co/DkzY6Xp/img-11.jpg",
    "contact_info": {
      "agent_name": "Emma Thompson",
      "agent_contact": "+44 1234 567890"
    }
  },
  {
    "id": 2,
    "estate_title": "Modern Loft in Historic Downtown",
    "segment_name": "Apartments",
    "description": "Experience urban living at its finest in this modern loft apartment located in a historic downtown district, offering luxury and convenience.",
    "long_description": "Immerse yourself in the vibrant energy of Old Montreal from the comfort of this sleek modern loft. With its exposed brick walls, soaring ceilings, and rooftop terrace overlooking the city skyline, every corner exudes contemporary elegance. Step outside to explore the eclectic mix of boutiques, cafes, and cultural attractions that define this historic district. Whether savoring a gourmet meal at a nearby bistro or unwinding amidst the breathtaking views from your private terrace, every moment here is infused with the allure of urban living. Elevate your lifestyle in this sophisticated retreat where modern luxury meets timeless charm.",
    "price": "$700/Night",
    "status": "Rent",
    "area": "1800 sq ft",
    "location": "Old Montreal, Canada",
    "facilities": ["exposed brick walls", "high ceilings", "rooftop terrace"],
    "image": "https://i.ibb.co/vjsHk09/p-10.png",
    "contact_info": {
      "agent_name": "Alexandre Dupont",
      "agent_contact": "+1 (514) 234-5678"
    }
  },
  {
    "id": 3,
    "estate_title": "Family-Friendly Townhouse with Playground",
    "segment_name": "Townhouses",
    "description": "Perfect for families, this townhouse offers spacious living areas and a dedicated playground, creating an ideal environment for children.",
    "long_description": "Welcome to family paradise in Sunnyvale, where this townhouse embodies the perfect blend of comfort and convenience. With its spacious living areas, modern amenities, and dedicated playground, it's designed to accommodate every aspect of family life. Let children's laughter fill the air as they explore the playground or splash in the community pool, while parents unwind in the serene surroundings of their private sanctuary. With its prime location and family-friendly amenities, this townhouse offers an unparalleled lifestyle where every moment is cherished and every memory is made.",
    "price": "$600,000",
    "status": "Sale",
    "area": "2200 sq ft",
    "location": "Sunnyvale, California",
    "facilities": ["playground", "community pool", "attached garage"],
    "image": "https://i.ibb.co/L5yx7Kj/ing-3.jpg",
    "contact_info": {
      "agent_name": "Jennifer Lee",
      "agent_contact": "+1 (408) 345-6789"
    }
  },
  {
    "id": 4,
    "estate_title": "Prime Student Housing near University Campus",
    "segment_name": "Student Housing",
    "description": "Ideal for students, this housing complex offers convenient access to campus and modern amenities for comfortable student living.",
    "long_description": "Welcome to the epitome of student living in Cambridge, where this housing complex offers the perfect blend of convenience and comfort. With its proximity to campus, modern amenities, and vibrant community atmosphere, it provides everything students need for a fulfilling college experience. Whether hitting the books in the study lounge, staying active in the fitness center, or socializing with friends in the shared living spaces, every aspect of student life is catered to. Embrace the collegiate lifestyle in this dynamic community where academic success and personal growth go hand in hand.",
    "price": "$1,200/month",
    "status": "Rent",
    "area": "900 sq ft",
    "location": "Cambridge, Massachusetts",
    "facilities": ["study lounge", "fitness center", "laundry facilities"],
    "image": "https://i.ibb.co/JFr4WvQ/img-4.jpg",
    "contact_info": {
      "agent_name": "David Wilson",
      "agent_contact": "+1 (617) 456-7890"
    }
  },
  {
    "id": 5,
    "estate_title": "Retirement Villa in Sun-kissed Community",
    "segment_name": "Senior Living Communities",
    "description": "Enjoy your golden years in this retirement villa situated in a sun-kissed community, offering resort-style amenities and peaceful surroundings.",
    "long_description": "Welcome to the epitome of retirement living in Scottsdale, where this villa offers a tranquil oasis for those seeking relaxation and rejuvenation. With its resort-style amenities, sun-kissed surroundings, and vibrant community atmosphere, it provides the perfect setting for a fulfilling retirement. Whether lounging by the pool, perfecting your swing on the golf course, or socializing with neighbors in the clubhouse, every day brings new opportunities for leisure and enjoyment. Embrace the golden years in this idyllic sanctuary where every moment is cherished and every day is filled with joy.",
    "price": "$800,000",
    "status": "Sale",
    "area": "2500 sq ft",
    "location": "Scottsdale, Arizona",
    "facilities": ["clubhouse", "swimming pool", "golf course"],
    "image": "https://i.ibb.co/Pjb0SB8/img-5.jpg",
    "contact_info": {
      "agent_name": "Sophia Davis",
      "agent_contact": "+1 (480) 567-8901"
    }
  },
  {
    "id": 6,
    "estate_title": "Luxury Beachfront Condo with Panoramic Views",
    "segment_name": "Vacation Rentals",
    "description": "Indulge in luxury beachfront living in this stunning condo offering panoramic views of the ocean and access to resort-style amenities.",
    "long_description": "Welcome to paradise in Miami Beach, where this luxurious beachfront condo offers a lavish escape from the ordinary. With its breathtaking panoramic views of the ocean, stylish interiors, and access to resort-style amenities, it's the ultimate destination for indulgence and relaxation. Whether lounging by the pool, sipping cocktails on your private balcony, or strolling along the pristine sandy shores, every moment here is filled with tranquility and luxury. Experience the pinnacle of beachfront living in this exclusive retreat where every day feels like a dream.",
    "price": "$500/Night",
    "status": "Rent",
    "area": "1500 sq ft",
    "location": "Miami Beach, Florida",
    "facilities": ["beach access", "poolside cabanas", "fitness center"],
    "image": "https://i.ibb.co/80Cb4MK/img-6.png",
    "contact_info": {
      "agent_name": "Michael Brown",
      "agent_contact": "+1 (305) 678-9012"
    }
  },
  {
    "id": 7,
    "estate_title": "Mountain Retreat Cabin with Scenic Views",
    "segment_name": "Vacation Rentals",
    "description": "Escape to the mountains in this cozy cabin retreat, offering scenic views and proximity to outdoor adventures.",
    "long_description": "Welcome to your mountain sanctuary in Lake Tahoe, where this cozy cabin retreat offers a peaceful escape amidst breathtaking natural beauty. With its charming rustic interiors, wraparound deck, and panoramic views of the surrounding mountains, it's the perfect setting for relaxation and rejuvenation. Whether cozying up by the fire pit, exploring the nearby hiking trails, or simply soaking in the serene surroundings, every moment here is filled with tranquility and adventure. Experience the magic of mountain living in this idyllic retreat where memories are made and worries are left behind.",
    "price": "$300/Night",
    "status": "Rent",
    "area": "1200 sq ft",
    "location": "Lake Tahoe, Nevada",
    "facilities": ["wraparound deck", "fire pit", "hiking trails"],
    "image": "https://i.ibb.co/98Cqwkz/img-7.jpg",
    "contact_info": {
      "agent_name": "Sarah Johnson",
      "agent_contact": "+1 (775) 890-1234"
    }
  },
  {
    "id": 8,
    "estate_title": "Historic Mansion in Prestigious Neighborhood",
    "segment_name": "Luxury Homes",
    "description": "Own a piece of history with this magnificent historic mansion located in a prestigious neighborhood, boasting timeless elegance and grandeur.",
    "long_description": "Step into a world of opulence and sophistication with this historic mansion in the Upper East Side of New York. Built to impress, this architectural marvel exudes timeless elegance and grandeur at every turn. From its meticulously landscaped formal gardens to its palatial ballroom and wine cellar, every detail speaks of luxury and refinement. Live like royalty in this prestigious neighborhood, where the finest restaurants, boutiques, and cultural attractions are just steps away. Experience the epitome of luxury living in this iconic mansion, where history and modernity intertwine to create an unparalleled lifestyle.",
    "price": "$5,000,000",
    "status": "Sale",
    "area": "10000 sq ft",
    "location": "Upper East Side, New York",
    "facilities": ["formal gardens", "ballroom", "wine cellar"],
    "image": "https://i.ibb.co/Z2Gxycs/img-8.jpg",
    "contact_info": {
      "agent_name": "William Johnson",
      "agent_contact": "+1 (212) 345-6789"
    }
  },
  {
    "id": 9,
    "estate_title": "Exclusive Penthouse with Skyline Views",
    "segment_name": "Luxury Homes",
    "description": "Experience luxury living at its finest in this exclusive penthouse offering breathtaking skyline views and unparalleled elegance.",
    "long_description": "Welcome to the epitome of luxury living in Beverly Hills, where this exclusive penthouse offers a lifestyle of unparalleled elegance and sophistication. Perched high above the city skyline, it boasts breathtaking panoramic views of the iconic Hollywood Hills and beyond. With its sleek modern design, state-of-the-art amenities, and private elevator access, it's the ultimate retreat for discerning homeowners. Whether hosting lavish soirées in the expansive living spaces or unwinding in the infinity pool overlooking the city lights, every moment here is imbued with luxury and style. Elevate your lifestyle in this exclusive penthouse where sky-high living meets unparalleled elegance.",
    "price": "$3,500,000",
    "status": "Sale",
    "area": "3000 sq ft",
    "location": "Beverly Hills, California",
    "facilities": ["private elevator", "infinity pool", "home automation"],
    "image": "https://i.ibb.co/vX0RpS6/ing-9.jpg",
    "isHidden": true,
    "contact_info": {
      "agent_name": "James Smith",
      "agent_contact": "+1 (310) 456-7890"
    }
  }
]
